app/views/orders/_form.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id,Category.all,:id,:name,{include_blank: 'Select a category' },{class: "form-select" } %>
---
SELECT "categories".* FROM "categories"