app/controllers/orders_controller.rb

INSERT INTO "orders" ("currency", "gross", "discount", "net", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["currency", 1], ["gross", 300.0], ["discount", 100.0], ["net", 200.0], ["created_at", "2021-11-16 20:04:24.714609"], ["updated_at", "2021-11-16 20:04:24.714609"], ["category_id", 1]]
---
  def create
    @order = Order.new(order_params)
    respond_to do |format|
      if @order.save

UPDATE "orders" SET "currency" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["currency", 1], ["updated_at", "2021-11-16 08:41:54.363364"], ["id", 1]]
---
  def update
    respond_to do |format|

      if (order_params[:discount].empty?)
        order_params[:discount]=0
      end
      if @order.update(order_params)